app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."likeable_id" = $1 AND "likes"."likeable_type" = 'Product' AND "likes"."user_id" = $2 LIMIT $3  [["likeable_id", "3"], ["user_id", "1"], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 AND "products"."user_id" = $2  [["id", 3], ["user_id", "1"]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 24]]
---
  def like_create
    @product = Product.find(params[:likeable_id])
    like = Like.find_or_initialize_by(likeable_id: params[:likeable_id], :likeable_type=>@product.class.name.constantize,:user_id=>current_user.id)
    if like.like
      like.destroy

SELECT "products".* FROM "products"
---
   def download_products
    @products = Product.all

INSERT INTO "products" ("name", "desc", "address", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "vishal"], ["desc", "tayg"], ["address", "ihjghjghj"], ["user_id", "1"], ["created_at", 2016-09-29 05:58:51 UTC], ["updated_at", 2016-09-29 05:58:51 UTC]]
---
  def create
    @product = Product.new(product_params)
    @product.save!

UPDATE "products" SET "name" = $1, "image" = $2, "address" = $3, "updated_at" = $4 WHERE "products"."id" = $5
---
  def update
    respond_to do |format|
      if @product.update(product_params)