app/views/products/show.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."likeable_id" = $1 AND "likes"."likeable_type" = $2  [["likeable_id", "2"], ["likeable_type", "Product"]]
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1  [["user_id", "1"]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."likeable_id" = $1 AND "likes"."likeable_type" = $2 AND "likes"."like" = $3  [["likeable_id", "3"], ["likeable_type", "Product"], ["like", true]]
---

	<%= link_to (current_user.like.present? ? "dislike"  : " like"), like_create_path(likeable_id: @product.id, likeable_type: "Product"), method: :post   %>(<%= @product.likes.where(like: true).count %>)